Catalogs/ДескрипторыДоступаОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ДескрипторыДоступаОбъектов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМероприятий</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыВнутреннихДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыВходящихДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыИсходящихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВопросДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрифДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрифыДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляЛокальныхАдминистраторов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъектаМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтейнерПользователей</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтейнерПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Папка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Папки</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПапкаПередаетВсеПрава</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хэш</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПустойДескриптор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ра_Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаДоступа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыДоступаКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаДоступа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыДоступаФизическихЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаПрав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КонтейнерПользователей</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Право</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравоЗапрещено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаследованиеРазрешено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ОчередьОбновленияПравДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОчередьОбновленияПравДоступа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВМиллиСекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбновлениеЗависимыхПрав</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДопСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПраваПоДескрипторамДоступаОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПраваПоДескрипторамДоступаОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Добавление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УправлениеПравами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Чтение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дескриптор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДескрипторыДоступаОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ДелегированиеПрав</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ДескрипторыДоступаОбъектов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Ссылка");
	Поля.Добавить("КонтейнерПользователей");
	Поля.Добавить("Изменение");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если Данные.КонтейнерПользователей <> Неопределено Тогда
		Представление = Строка(Данные.КонтейнерПользователей)
			+ " (" + ?(Данные.Изменение, "Изменение", "Чтение") + ")";
	Иначе
		Представление = Данные.Ссылка.УникальныйИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

// Выполняет расчет и перезапись прав доступа по указанному определителю
// Возвращает в массиве ПротоколРасчетаПрав перечень данных, которые 
// были использованы при расчете прав
//
// Параметры:
//  
//  ДескрипторСсылка - Ссылка - дескриптор
//  ПротоколРасчетаПрав - Массив - протокол расчета, который будет показан пользователю
//  Немедленно - Булево
//  ОбновитьЗависимыеНемедленно - Булево
//  
Процедура ОбновитьПрава(ДескрипторСсылка, ПротоколРасчетаПрав = Неопределено, Немедленно = Неопределено) Экспорт
	
	// Проверка на отложенное обновление прав доступа
	Если ДокументооборотПраваДоступаПовтИсп.ОтложенноеОбновлениеПравДоступа()
		И Немедленно <> Истина Тогда
		
		// Добавление в очередь
		РегистрыСведений.ОчередьОбновленияПравДоступа.Добавить(ДескрипторСсылка);
		Возврат;
		
	КонецЕсли;
	
	РассчитатьПрава(ДескрипторСсылка, ПротоколРасчетаПрав);
	ДокументооборотПраваДоступа.ОбновитьПраваСвязанныхДескрипторовПоДескриптору(ДескрипторСсылка);
	
КонецПроцедуры

// Выполняет расчет и запись прав
// 
// ДескрипторСсылка - ссылка на дескриптор
// 
Процедура РассчитатьПрава(ДескрипторСсылка, ПротоколРасчетаПрав = Неопределено) Экспорт
	
	РеквизитыДескриптора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДескрипторСсылка,
		"ИдентификаторОбъектаМетаданных, ЭтоПустойДескриптор,
		|Группа, КонтейнерПользователей, ДляЛокальныхАдминистраторов");
	
	ИдОбъекта = РеквизитыДескриптора.ИдентификаторОбъектаМетаданных;
	ЭтоИндивидуальныйДескриптор = ЗначениеЗаполнено(РеквизитыДескриптора.КонтейнерПользователей);
	ЭтоДескрипторДляЛокальныхАдминистраторов = РеквизитыДескриптора.ДляЛокальныхАдминистраторов;
	
	НазначениеДескриптора = НазначениеДескриптора(
		ЭтоИндивидуальныйДескриптор, ЭтоДескрипторДляЛокальныхАдминистраторов);
	
	// Расчет прав запросом
	ДескрипторыКРасчету = Новый Массив;
	ДескрипторыКРасчету.Добавить(ДескрипторСсылка);
	РассчитатьПраваЗапросом(ДескрипторыКРасчету, ИдОбъекта, НазначениеДескриптора, ПротоколРасчетаПрав);
	
КонецПроцедуры

// Рассчитывает права для переданного массива дескрипторов
// 
// Параметры:
//  
//  Дескрипторы - Массив - массив дескрипторов, чьи права нужно рассчитать.
//  ИдОбъекта - Ссылка - идентификатор объекта метаданных, назначенный переданным дескрипторам.
//  НазначениеДескрипторов - Строка - см. функцию НазначениеДескриптора()
//  ПротоколРасчетаПрав - Массив - протокол расчета, который будет показан пользователю.
//  
Процедура РассчитатьПраваЗапросом(
			Дескрипторы,
			ИдОбъекта,
			НазначениеДескрипторов,
			ПротоколРасчетаПрав = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Дескрипторы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Дескрипторы = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Дескрипторы);;
	
	ПолноеИмяМетаданных = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИдОбъекта, "ПолноеИмя");
	МенеджерОбъектаДоступа = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяМетаданных);
	
	ОбработатьДескрипторыИсключения(Дескрипторы, ИдОбъекта, МенеджерОбъектаДоступа);
	Если Дескрипторы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДескрипторыДляЗапроса = Дескрипторы;
	Если ПротоколРасчетаПрав <> Неопределено Тогда
		// Параметр запроса не должен меняться, поэтому делаем копию
		ДескрипторыДляЗапроса = Новый Массив;
		Для Каждого Эл Из Дескрипторы Цикл
			ДескрипторыДляЗапроса.Добавить(Эл);
		КонецЦикла;
	КонецЕсли;
	
	Если НазначениеДескрипторов = "Индивидуальный" Тогда
		
		ЗапросПоПравам = Новый Запрос;
		ЗапросПоПравам.Текст = 
			ДокументооборотПраваДоступаПовтИсп.ТекстЗапросаДляРасчетаПравИндивидуальныхДескрипторов();
		
	ИначеЕсли НазначениеДескрипторов = "ДляЛокальныхАдминистраторов" Тогда
		
		ЗапросПоПравам = ЗапросДляСтандартногоРасчетаПрав(
			ДескрипторыДляЗапроса, ИдОбъекта, МенеджерОбъектаДоступа);
		
		ЗапросПоПравам.Текст =
			ДокументооборотПраваДоступаПовтИсп.ТекстЗапросаДляРасчетаПравДляЛокальныхАдминистраторов();
		
	Иначе
		
		ЗапросПоПравам = Неопределено;
		ЕстьМетодЗапросДляРасчетаПрав = ОбщегоНазначенияДокументооборотПовтИсп.ЕстьМетодМенеджера(
			ПолноеИмяМетаданных, "ЗапросДляРасчетаПрав");
		
		Если ЕстьМетодЗапросДляРасчетаПрав Тогда
			ЗапросПоПравам = МенеджерОбъектаДоступа.ЗапросДляРасчетаПрав(
				ДескрипторыДляЗапроса, ИдОбъекта, МенеджерОбъектаДоступа);
		Иначе
			ЗапросПоПравам = ЗапросДляСтандартногоРасчетаПрав(
				ДескрипторыДляЗапроса, ИдОбъекта, МенеджерОбъектаДоступа);
		КонецЕсли;
		
		Если ЗапросПоПравам = Неопределено Тогда
			ВызватьИсключение "" + ИдОбъекта + ": " + НСтр("ru = 'Не найден запрос для расчета прав'; en = 'Query for permissions calculation is not found'");
		КонецЕсли;
		
	КонецЕсли;
	
	ЗапросПоПравам.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗапросПоПравам.УстановитьПараметр("Дескрипторы", ДескрипторыДляЗапроса);
	ЗапросПоПравам.УстановитьПараметр("Идентификатор", ИдОбъекта);
	
	Результат = ЗапросПоПравам.Выполнить();
	ВыборкаПоДескрипторам = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоДескрипторам.Следующий() Цикл
		
		// Удаление обработанного дескриптора из массива
		Индекс = Дескрипторы.Найти(ВыборкаПоДескрипторам.Дескриптор);
		Если Индекс <> Неопределено Тогда
			Дескрипторы.Удалить(Индекс);
		КонецЕсли;
		
		// Права не менялись
		Если Не ВыборкаПоДескрипторам.ПраваИзменены Тогда
			Продолжить;
		КонецЕсли;
		
		// Запись новых прав
		НаборЗаписей = РегистрыСведений.ПраваПоДескрипторамДоступаОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Дескриптор.Установить(ВыборкаПоДескрипторам.Дескриптор);
		
		Выборка = ВыборкаПоДескрипторам.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	// Если дескриптор не попал в запрос, значит его права должны быть пустыми
	Для Каждого Дескриптор Из Дескрипторы Цикл
		НаборЗаписей = РегистрыСведений.ПраваПоДескрипторамДоступаОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Дескриптор.Установить(Дескриптор);
		НаборЗаписей.Записать();
	КонецЦикла;
	
	Если ПротоколРасчетаПрав <> Неопределено Тогда
		Если НазначениеДескрипторов = "Основной" И ЕстьМетодЗапросДляРасчетаПрав Тогда
			МенеджерОбъектаДоступа.ЗаполнитьПротоколРасчетаПрав(ПротоколРасчетаПрав, ЗапросПоПравам);
		Иначе
			ЗаполнитьПротоколРасчетаПравСтандартно(ПротоколРасчетаПрав, ЗапросПоПравам, НазначениеДескрипторов);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Обновляет права дескрипторов в части руководителей и делегатов.
//
// Параметры:
//  Дескрипторы - Массив, Ссылка - дескрипторы, чьи права нужно обновить.
// 
Процедура ОбновитьПраваПоСоставуСубъектов(Дескрипторы) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПраваПоДескрипторамДоступаОбъектов.Дескриптор,
		|	ПраваПоДескрипторамДоступаОбъектов.Пользователь,
		|	ПраваПоДескрипторамДоступаОбъектов.Добавление,
		|	ПраваПоДескрипторамДоступаОбъектов.Изменение,
		|	ПраваПоДескрипторамДоступаОбъектов.Удаление,
		|	ПраваПоДескрипторамДоступаОбъектов.УправлениеПравами,
		|	ПраваПоДескрипторамДоступаОбъектов.Чтение
		|ПОМЕСТИТЬ НовыеПрава
		|ИЗ
		|	РегистрСведений.ПраваПоДескрипторамДоступаОбъектов КАК ПраваПоДескрипторамДоступаОбъектов
		|ГДЕ
		|	ПраваПоДескрипторамДоступаОбъектов.Дескриптор В(&Дескрипторы)
		|	И ПраваПоДескрипторамДоступаОбъектов.ОбъектОснование = НЕОПРЕДЕЛЕНО");
	
	ДокументооборотПраваДоступа.ДополнитьТекстЗапросаПоПравам(Запрос.Текст);
	Запрос.УстановитьПараметр("Дескрипторы", Дескрипторы);
	Результат = Запрос.Выполнить();
	ВыборкаПоДескрипторам = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоДескрипторам.Следующий() Цикл
		
		// Права не менялись
		Если Не ВыборкаПоДескрипторам.ПраваИзменены Тогда
			Продолжить;
		КонецЕсли;
		
		// Запись новых прав
		НаборЗаписей = РегистрыСведений.ПраваПоДескрипторамДоступаОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Дескриптор.Установить(ВыборкаПоДескрипторам.Дескриптор);
		
		Выборка = ВыборкаПоДескрипторам.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Рассчитывает права пустых дескрипторов и дескрипторов групп,
// удаляет эти дескрипторы из массива
//  
// Параметры:
//  
//  Дескрипторы - Массив - массив дескрипторов, чьи права нужно рассчитать
//  ИдОбъекта - Ссылка - идентификатор объекта метаданных, назначенный переданным дескрипторам
//  МенеджерОбъектаДоступа - СправочникМенеджер, ДокументМенеджер, ... - менеджер объекта доступа
//  
Процедура ОбработатьДескрипторыИсключения(Дескрипторы, ИдОбъекта, МенеджерОбъектаДоступа)
	
	// Дескрипторы групп и пустые дескрипторы - учитываются только права ролей.
	ЗапросПоДескрипторамГрупп = Новый Запрос(
		"ВЫБРАТЬ
		|	ДескрипторыДоступаОбъектов.Ссылка КАК Дескриптор
		|ИЗ
		|	Справочник.ДескрипторыДоступаОбъектов КАК ДескрипторыДоступаОбъектов
		|ГДЕ
		|	ДескрипторыДоступаОбъектов.Ссылка В(&Дескрипторы)
		|	И (ДескрипторыДоступаОбъектов.Группа
		|			ИЛИ ДескрипторыДоступаОбъектов.ЭтоПустойДескриптор)");
		
	ЗапросПоДескрипторамГрупп.УстановитьПараметр("Дескрипторы", Дескрипторы);
	Результат = ЗапросПоДескрипторамГрупп.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ДескрипторыИсключения = Результат.Выгрузить().ВыгрузитьКолонку("Дескриптор");
	
	Для Каждого ДескрипторГруппы Из ДескрипторыИсключения Цикл
		Индекс = Дескрипторы.Найти(ДескрипторГруппы);
		Если Индекс <> Неопределено Тогда
			Дескрипторы.Удалить(Индекс);
		КонецЕсли;
	КонецЦикла;
	
	ЗапросПоПравам = ЗапросДляСтандартногоРасчетаПрав(
		ДескрипторыИсключения, ИдОбъекта, МенеджерОбъектаДоступа);
	
	Результат = ЗапросПоПравам.Выполнить();
	ВыборкаПоДескрипторам = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоДескрипторам.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ПраваПоДескрипторамДоступаОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Дескриптор.Установить(ВыборкаПоДескрипторам.Дескриптор);
		
		Выборка = ВыборкаПоДескрипторам.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
		Индекс = ДескрипторыИсключения.Найти(ВыборкаПоДескрипторам.Дескриптор);
		Если Индекс <> Неопределено Тогда
			ДескрипторыИсключения.Удалить(Индекс);
		КонецЕсли;
		
	КонецЦикла;
	
	// Если дескриптор не попал в запрос, значит его права должны быть пустыми
	Для Каждого Дескриптор Из ДескрипторыИсключения Цикл
		НаборЗаписей = РегистрыСведений.ПраваПоДескрипторамДоступаОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Дескриптор.Установить(Дескриптор);
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  
//  ПротоколРасчетаПрав - Массив - протокол для заполнения
//  ЗапросПоПравам - Запрос - запрос, который использовался для расчета прав дескрипторов
//  Дескрипторы - Массив - массив дескрипторов, чьи права были рассчитаны
//  НазначениеДескриптора - Строка - см. функцию НазначениеДескриптора()
//  
Процедура ЗаполнитьПротоколРасчетаПравСтандартно(
			ПротоколРасчетаПрав,
			ЗапросПоПравам,
			НазначениеДескриптора = "Основной") Экспорт
	
	Если ПротоколРасчетаПрав = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Таблицы запроса, которые будут нужны для заполнения протокола
	ИменаТаблицДляЗаполненияПротокола = Новый Массив;
	ИменаТаблицДляЗаполненияПротокола.Добавить("ПраваПоРазрешениямДоступа");
	ИменаТаблицДляЗаполненияПротокола.Добавить("НастройкиПапок");
	ИменаТаблицДляЗаполненияПротокола.Добавить("РабочиеГруппы");
	
	РезультатыЗапросов = ОбщегоНазначенияДокументооборот.ДанныеИзВременныхТаблицЗапроса(
		ЗапросПоПравам, ИменаТаблицДляЗаполненияПротокола);
	
	Для Сч = 0 По ИменаТаблицДляЗаполненияПротокола.Количество() - 1 Цикл
		
		Результат = РезультатыЗапросов[Сч];
		ИмяПодзапроса = ИменаТаблицДляЗаполненияПротокола[Сч];
		
		// Такой ВТ нет в запросе
		Если Результат = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИмяПодзапроса = "ПраваПоРазрешениямДоступа" Тогда
			
			ЗаписьПротокола = Новый Структура("Элемент, Описание", "ПолитикиДоступа", 
				НСтр("ru = 'Политики доступа'; en = 'Access policies'"));
			ПротоколРасчетаПрав.Добавить(ЗаписьПротокола);
			
		ИначеЕсли ИмяПодзапроса = "НастройкиПапок" Тогда
			
			Если Не Результат.Пустой() Тогда
				ЗаписьПротокола = Новый Структура("Элемент, Описание",
					"НастройкиПравПапки", НСтр("ru = 'Настройки прав папки'; en = 'Folder permission settings'"));
				ПротоколРасчетаПрав.Добавить(ЗаписьПротокола);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Создает и заполняет новый дескриптор доступа по указанному объекту.
// Параметры:
//	ОбъектДоступа - Объект, Структура - Объект или описание объекта,
//		полученное с помощью метода ПолучитьПоляДоступа.
// 
Функция СоздатьДескрипторОсновной(ОбъектДоступа) Экспорт
	
	Дескриптор = Справочники.ДескрипторыДоступаОбъектов.СоздатьЭлемент();
	ЭтоГруппаСправочника = Ложь;
	
	Если ТипЗнч(ОбъектДоступа) = Тип("Структура") Тогда
		МетаданныеОбъектаДоступа = ОбъектДоступа.Ссылка.Метаданные();
		ЭтоГруппаСправочника = ОбъектДоступа.Свойство("ЭтоГруппа") И ОбъектДоступа.ЭтоГруппа;
	Иначе
		МетаданныеОбъектаДоступа = ОбъектДоступа.Метаданные();
		ЭтоГруппаСправочника = ОбщегоНазначения.ЭтоСправочник(МетаданныеОбъектаДоступа) И ОбъектДоступа.ЭтоГруппа;
	КонецЕсли;
	
	Дескриптор.ИдентификаторОбъектаМетаданных =
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных(МетаданныеОбъектаДоступа);
	
	Если ЭтоГруппаСправочника Тогда
		// Для групп справочников заполнение дескриптора не требуется.
		Дескриптор.Группа = Истина;
	Иначе	
		ПолноеИмя = МетаданныеОбъектаДоступа.ПолноеИмя();
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
	 	Менеджер.ЗаполнитьОсновнойДескриптор(ОбъектДоступа, Дескриптор);
	КонецЕсли;	
	
	ОчиститьНеиспользуемыеРеквизитыДескриптора(Дескриптор);
	
	Дескриптор.ЗаполнитьПризнакПустого();
	Дескриптор.РассчитатьХэш();
	
	Возврат Дескриптор;
	
КонецФункции

// Создает и заполняет новый дескриптор доступа для элемента рабочей группы.
//
// Параметры:
//  ОбъектМетаданных - Ссылка - идентификатор объекта метаданных, который будет назначен дескриптору.
//  Элемент - Пользователь, РабочаяГруппа, Подразделение - контейнер, который будет назначен дескриптору.
//  Изменение - Булево - признак того, что для пользователей контейнера будет доступно право Изменение.
// 
// Возвращаемое значение:
//  Ссылка - ссылка на созданный дескриптор.
// 
Функция СоздатьДескрипторИндивидуальный(ОбъектМетаданных, Элемент, Изменение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Дескриптор = Справочники.ДескрипторыДоступаОбъектов.СоздатьЭлемент();
	Дескриптор.ИдентификаторОбъектаМетаданных = ОбъектМетаданных;
	Дескриптор.КонтейнерПользователей = Элемент;
	Дескриптор.Изменение = Изменение;
	Дескриптор.РассчитатьХэш();
	
	Возврат Дескриптор;
	
КонецФункции

Процедура ОчиститьНеиспользуемыеРеквизитыДескриптора(Дескриптор)
	
	НеИспользуемыеРеквизиты = ДокументооборотПраваДоступаПовтИсп.НеиспользуемыеРеквизитыДескриптора(
		Дескриптор.ИдентификаторОбъектаМетаданных);
	
	Для Каждого ИмяРеквизита Из НеИспользуемыеРеквизиты Цикл
		
		ЗначениеРеквизита = Дескриптор[ИмяРеквизита];
		Если ТипЗнч(ЗначениеРеквизита) = Тип("СправочникТабличнаяЧасть.ДескрипторыДоступаОбъектов.Контрагенты") Или
			ТипЗнч(ЗначениеРеквизита) = Тип("СправочникТабличнаяЧасть.ДескрипторыДоступаОбъектов.ФизическиеЛица") Тогда
			Дескриптор[ИмяРеквизита].Очистить();
		Иначе
			Дескриптор[ИмяРеквизита] = Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Находит существующий дескриптор доступа по переданному образцу.
// Если дескриптор не найден, то возвращает Неопределено.
Функция НайтиДескрипторПоОбразцу(Дескриптор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтобранныеПоХэшу.Ссылка
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДескрипторыДоступаОбъектов.Ссылка КАК Ссылка,
		|		ДескрипторыДоступаОбъектов.ВидОбъекта КАК ВидОбъекта,
		|		ДескрипторыДоступаОбъектов.ВопросДеятельности КАК ВопросДеятельности,
		|		ДескрипторыДоступаОбъектов.ГрифДоступа КАК ГрифДоступа,
		|		ДескрипторыДоступаОбъектов.Группа КАК Группа,
		|		ДескрипторыДоступаОбъектов.ДляЛокальныхАдминистраторов КАК ДляЛокальныхАдминистраторов,
		|		ДескрипторыДоступаОбъектов.ИдентификаторОбъектаМетаданных КАК ИдентификаторОбъектаМетаданных,
		|		ДескрипторыДоступаОбъектов.Изменение КАК Изменение,
		|		ДескрипторыДоступаОбъектов.КонтейнерПользователей КАК КонтейнерПользователей,
		|		ДескрипторыДоступаОбъектов.ОбъектДоступа КАК ОбъектДоступа,
		|		ДескрипторыДоступаОбъектов.Организация КАК Организация,
		|		ДескрипторыДоступаОбъектов.Папка КАК Папка,
		|		ДескрипторыДоступаОбъектов.ПапкаПередаетВсеПрава КАК ПапкаПередаетВсеПрава,
		|		ДескрипторыДоступаОбъектов.Подразделение КАК Подразделение,
		|		ДескрипторыДоступаОбъектов.Проект КАК Проект,
		// ТСК Талько Э.Г.; 09.06.2018; Управление доступом {
		|		ДескрипторыДоступаОбъектов.ра_Организация КАК ра_Организация,
		// ТСК Талько Э.Г.; 09.06.2018; Управление доступом }
		|		ДескрипторыДоступаОбъектов.ЭтоПустойДескриптор КАК ЭтоПустойДескриптор
		|	ИЗ
		|		Справочник.ДескрипторыДоступаОбъектов КАК ДескрипторыДоступаОбъектов
		|	ГДЕ
		|		ДескрипторыДоступаОбъектов.Хэш = &Хэш) КАК ОтобранныеПоХэшу
		|ГДЕ
		|	ОтобранныеПоХэшу.ВидОбъекта = &ВидОбъекта
		|	И ОтобранныеПоХэшу.ВопросДеятельности = &ВопросДеятельности
		|	И ОтобранныеПоХэшу.ГрифДоступа = &ГрифДоступа
		|	И ОтобранныеПоХэшу.Группа = &Группа
		|	И ОтобранныеПоХэшу.ДляЛокальныхАдминистраторов = &ДляЛокальныхАдминистраторов
		|	И ОтобранныеПоХэшу.ИдентификаторОбъектаМетаданных = &ИдентификаторОбъектаМетаданных
		|	И ОтобранныеПоХэшу.Изменение = &Изменение
		|	И ОтобранныеПоХэшу.КонтейнерПользователей = &КонтейнерПользователей
		|	И ОтобранныеПоХэшу.ОбъектДоступа = &ОбъектДоступа
		|	И ОтобранныеПоХэшу.Организация = &Организация
		|	И ОтобранныеПоХэшу.Папка = &Папка
		|	И ОтобранныеПоХэшу.ПапкаПередаетВсеПрава = &ПапкаПередаетВсеПрава
		|	И ОтобранныеПоХэшу.Подразделение = &Подразделение
		|	И ОтобранныеПоХэшу.Проект = &Проект
		// ТСК Талько Э.Г.; 09.06.2018; Управление доступом {
		|	И ОтобранныеПоХэшу.ра_Организация = &ра_Организация
		// ТСК Талько Э.Г.; 09.06.2018; Управление доступом }
		|	И ОтобранныеПоХэшу.ЭтоПустойДескриптор = &ЭтоПустойДескриптор";
	
	Запрос.УстановитьПараметр("ВидОбъекта", Дескриптор.ВидОбъекта);
	Запрос.УстановитьПараметр("ВопросДеятельности", Дескриптор.ВопросДеятельности);
	Запрос.УстановитьПараметр("ГрифДоступа", Дескриптор.ГрифДоступа);
	Запрос.УстановитьПараметр("Группа", Дескриптор.Группа);
	Запрос.УстановитьПараметр("ДляЛокальныхАдминистраторов", Дескриптор.ДляЛокальныхАдминистраторов);
	Запрос.УстановитьПараметр("ИдентификаторОбъектаМетаданных", Дескриптор.ИдентификаторОбъектаМетаданных);
	Запрос.УстановитьПараметр("Изменение", Дескриптор.Изменение);
	Запрос.УстановитьПараметр("КонтейнерПользователей", Дескриптор.КонтейнерПользователей);
	Запрос.УстановитьПараметр("ОбъектДоступа", Дескриптор.ОбъектДоступа);
	Запрос.УстановитьПараметр("Организация", Дескриптор.Организация);
	Запрос.УстановитьПараметр("Папка", Дескриптор.Папка);
	Запрос.УстановитьПараметр("ПапкаПередаетВсеПрава", Дескриптор.ПапкаПередаетВсеПрава);
	Запрос.УстановитьПараметр("Подразделение", Дескриптор.Подразделение);
	Запрос.УстановитьПараметр("Проект", Дескриптор.Проект);
	// ТСК Талько Э.Г.; 09.06.2018; Управление доступом {
	Запрос.УстановитьПараметр("ра_Организация", Дескриптор.ра_Организация);
	// ТСК Талько Э.Г.; 09.06.2018; Управление доступом }
	Запрос.УстановитьПараметр("Хэш", Дескриптор.Хэш);
	Запрос.УстановитьПараметр("ЭтоПустойДескриптор", Дескриптор.ЭтоПустойДескриптор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Дескриптор.КонтейнерПользователей)  // Для инд. дескриптора доп. проверка не нужна.
				Или ДескрипторыОдинаковы(Выборка.Ссылка.ПолучитьОбъект(), Дескриптор) Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает запрос для расчета прав доступа стандартным способом,
// т.е. с учетом ограничений по группам доступа, рабочим группам, правам папок.
//  
// Параметры:
//  
//  Дескрипторы - Массив - массив дескрипторов, чьи права нужно рассчитать
//  ИдОбъекта - Ссылка - идентификатор объекта метаданных, назначенный переданным дескрипторам
//  МенеджерОбъектаДоступа - СправочникМенеджер, ДокументМенеджер - менеджер объекта доступа
//  УчитыватьРабочиеГруппы - Булево
//  УчитыватьНастройкиПравПапок - Булево
//  УчитыватьПолитикиДоступа - Булево
//  
// Возвращаемое значение - Запрос - запрос, который выберет права доступа для переданного массива дескрипторов
//  
Функция ЗапросДляСтандартногоРасчетаПрав(
			Дескрипторы,
			ИдОбъекта,
			МенеджерОбъектаДоступа,
			УчитыватьНастройкиПравПапок = Неопределено,
			УчитыватьПолитикиДоступа = Истина) Экспорт
	
	Если УчитыватьНастройкиПравПапок = Неопределено Тогда
		УчитыватьНастройкиПравПапок = ОбщегоНазначенияДокументооборот.ЕстьМетодМенеджера(
			МенеджерОбъектаДоступа, "ПолучитьПравилаОбработкиНастроекПравПапки");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ДокументооборотПраваДоступаПовтИсп.ТекстЗапросаДляСтандартногоРасчетаПрав(
		УчитыватьНастройкиПравПапок, УчитыватьПолитикиДоступа);
		
	РеквизитыИдентификатора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ИдОбъекта, "ПолноеИмя, ЗначениеПустойСсылки");
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(РеквизитыИдентификатора.ПолноеИмя);
	ЭтоПапка = ДокументооборотПраваДоступа.ЭтоПапка(
		ТипЗнч(РеквизитыИдентификатора.ЗначениеПустойСсылки));
	
	Запрос.УстановитьПараметр("Дескрипторы", Дескрипторы);
	Запрос.УстановитьПараметр("Идентификатор", ИдОбъекта);
	Запрос.УстановитьПараметр("ЭтоПапка", ЭтоПапка);
	Запрос.УстановитьПараметр("ИдентификаторДляПроверкиПолитикДоступа",
		ДокументооборотПраваДоступаПереопределяемый.ИдентификаторДляПроверкиПолитикДоступа(
			ИдОбъекта, МетаданныеОбъекта));
	
	// Получение таблицы дескрипторов с видами доступа и их значениями
	Если УчитыватьПолитикиДоступа Тогда
		ЗапросПоДескрипторам = ДокументооборотПраваДоступаПовтИсп.ЗапросПоДескрипторамСВидамиДоступа();
		ЗапросПоДескрипторам.УстановитьПараметр("Дескрипторы", Дескрипторы);
		ТаблицаДескрипторов = ЗапросПоДескрипторам.Выполнить().Выгрузить();
		Запрос.УстановитьПараметр("ТаблицаДескрипторов", ТаблицаДескрипторов);
	КонецЕсли;
	
	// Получение таблицы правил обработки настроек прав папки
	Если УчитыватьНастройкиПравПапок Тогда
		ПравилаОбработкиНастроекПапки = МенеджерОбъектаДоступа.ПолучитьПравилаОбработкиНастроекПравПапки();
		Запрос.УстановитьПараметр("ПравилаОбработкиНастроекПапки", ПравилаОбработкиНастроекПапки);
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

// Удаляет порцию устаревших данных.
// 
// Возвращаемое значение - Булево - Истина, если были найдены устаревшие данные, в противном случае Ложь.
// 
Функция УдалитьПорциюУстаревшихДанных() Экспорт
	
	Лимит = 5000;
	ОбработаноЗаписей = 0;
	ОбработаноУспешно = 0;
	ОбработаноСОшибками = 0;
	
	ЗапросДляПроверкиСсылок = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДескрипторыДляОбъектов.Дескриптор
		|ИЗ
		|	РегистрСведений.ДескрипторыДляОбъектов КАК ДескрипторыДляОбъектов
		|ГДЕ
		|	ДескрипторыДляОбъектов.Дескриптор = &Дескриптор");
	
	// Запрос, выбирающий дескрипторы, которые нужно удалить окончательно.
	ЗапросДляУдаления = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 500
		|	ДескрипторыДоступаОбъектов.Ссылка КАК Дескриптор,
		|	ДескрипторыДоступаОбъектов.ПометкаУдаления КАК ПометкаДескриптора,
		|	ЛОЖЬ КАК ЕстьСсылки
		|ИЗ
		|	Справочник.ДескрипторыДоступаОбъектов КАК ДескрипторыДоступаОбъектов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДескрипторыДляОбъектов КАК ДескрипторыДляОбъектов
		|		ПО ДескрипторыДоступаОбъектов.Ссылка = ДескрипторыДляОбъектов.Дескриптор
		|ГДЕ
		|	ДескрипторыДляОбъектов.Объект ЕСТЬ NULL ");
	
	ЕстьЗаписи = Истина;
	Пока ЕстьЗаписи И ОбработаноЗаписей < Лимит Цикл
		
		Результат = ЗапросДляУдаления.Выполнить();
		ЕстьЗаписи = Не Результат.Пустой();
		
		Выборка = Результат.Выбрать();
	 	ОбработатьВыборкуУстаревшихДанных(Выборка, ЗапросДляПроверкиСсылок, ОбработаноУспешно, ОбработаноСОшибками);
		
		ОбработаноЗаписей = ОбработаноЗаписей + Выборка.Количество();
		
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации(
		НСтр("ru='Удаление устаревших данных'; en = 'Deletion of outdated data'"), 
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Справочники.ДескрипторыДоступаОбъектов, , 
		СтрШаблон(
			НСтр("ru = 'Процедура завершена.
				|Обработано записей: %1
				|Из них:
				|	Успешно - %2
				|	С ошибками - %3'; en = 'Procedure completed successfully, processed %1 records'"),
			ОбработаноЗаписей, ОбработаноУспешно, ОбработаноСОшибками));
	
	Возврат ОбработаноЗаписей > 0;
	
КонецФункции

// Для служебного использования.
// 
Процедура ОбработатьВыборкуУстаревшихДанных(Выборка, ЗапросДляПроверкиСсылок, ОбработаноУспешно, ОбработаноСОшибками)
	
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.Дескриптор.ПолучитьОбъект();
		
		Попытка
			Объект.Заблокировать();
		Исключение
			// Объект может быть уже заблокирован
			ОбработаноСОшибками = ОбработаноСОшибками + 1;
			Продолжить;
		КонецПопытки;
		
		НачатьТранзакцию();
		Попытка
			// Удаление дескриптора
			Объект.Удалить();
			ЗапросДляПроверкиСсылок.УстановитьПараметр("Дескриптор", Выборка.Дескриптор);
			РезультатЗапросаПроверки = ЗапросДляПроверкиСсылок.Выполнить();
			
			Если РезультатЗапросаПроверки.Пустой() Тогда
				ЗафиксироватьТранзакцию();
				ОбработаноУспешно = ОбработаноУспешно + 1;
			Иначе
				ОтменитьТранзакцию();
				ОбработаноСОшибками = ОбработаноСОшибками + 1;
			КонецЕсли;
		Исключение
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Удаление устаревших дескрипторов доступа объектов'; en = 'Удаление устаревших дескрипторов доступа объектов'", 
					ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,
				Выборка.Дескриптор.Метаданные(),
				ПолучитьНавигационнуюСсылку(Выборка.Ссылка),
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
			ОбработаноСОшибками = ОбработаноСОшибками + 1;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Служебные методы

// Выполняет точное сравнение двух дескрипторов по всем табличным частям. 
// Возвращает Истина если дескрипторы одинаковы
Функция ДескрипторыОдинаковы(Дескриптор1, Дескриптор2)
	
	ТабличныеЧасти = Новый ТаблицаЗначений;
	ТабличныеЧасти.Колонки.Добавить("ИмяТабличнойЧасти");
	ТабличныеЧасти.Колонки.Добавить("ПоляДляПроверки");
	ТабличныеЧасти.Колонки.Добавить("КоличествоЗаписей");
	
	// Контрагенты
	ТЧ = ТабличныеЧасти.Добавить();
	ТЧ.ИмяТабличнойЧасти = "Контрагенты";
	ПоляДляПроверки = Новый Массив;
	ПоляДляПроверки.Добавить("ГруппаДоступа");
	ТЧ.ПоляДляПроверки = ПоляДляПроверки;
	
	// ФизическиеЛица
	ТЧ = ТабличныеЧасти.Добавить();
	ТЧ.ИмяТабличнойЧасти = "ФизическиеЛица";
	ПоляДляПроверки = Новый Массив;
	ПоляДляПроверки.Добавить("ГруппаДоступа");
	ТЧ.ПоляДляПроверки = ПоляДляПроверки;
	
	// НастройкаПрав
	ТЧ = ТабличныеЧасти.Добавить();
	ТЧ.ИмяТабличнойЧасти = "НастройкаПрав";
	ПоляДляПроверки = Новый Массив;
	ПоляДляПроверки.Добавить("Пользователь");
	ПоляДляПроверки.Добавить("Право");
	ПоляДляПроверки.Добавить("ПравоЗапрещено");
	ПоляДляПроверки.Добавить("НаследованиеРазрешено");
	ТЧ.ПоляДляПроверки = ПоляДляПроверки;
	
	// Сравнение количества записей
	Для Каждого ТЧ из ТабличныеЧасти Цикл
		ТЧ.КоличествоЗаписей = Дескриптор1[ТЧ.ИмяТабличнойЧасти].Количество();
		Если Дескриптор2[ТЧ.ИмяТабличнойЧасти].Количество() <> ТЧ.КоличествоЗаписей Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	// Поэлементное сравнение
	Для Каждого ТЧ из ТабличныеЧасти Цикл
		Если Не ТабличныеЧастиДескрипторовОдинаковы(Дескриптор1, Дескриптор2, 
			ТЧ.ИмяТабличнойЧасти, ТЧ.ПоляДляПроверки, ТЧ.КоличествоЗаписей) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции	

Функция ТабличныеЧастиДескрипторовОдинаковы(Дескриптор1, Дескриптор2, ИмяТабличнойЧасти, ПоляДляПроверки, КоличествоЗаписей)
	
	Для Сч = 0 По КоличествоЗаписей - 1 Цикл
		Для каждого ИмяПоля из ПоляДляПроверки Цикл
			
			Если Дескриптор1[ИмяТабличнойЧасти][Сч][ИмяПоля] <> Дескриптор2[ИмяТабличнойЧасти][Сч][ИмяПоля] Тогда
				Возврат Ложь;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция	НазначениеДескриптора(ЭтоИндивидуальныйДескриптор, ЭтоДескрипторДляЛокальныхАдминистраторов) Экспорт
	
	НазначениеДескриптора = "Основной";
	
	Если ЭтоИндивидуальныйДескриптор = Истина Тогда
		НазначениеДескриптора = "Индивидуальный";
	ИначеЕсли ЭтоДескрипторДляЛокальныхАдминистраторов = Истина Тогда
		НазначениеДескриптора = "ДляЛокальныхАдминистраторов";
	КонецЕсли;
	
	Возврат НазначениеДескриптора;
	
КонецФункции

#КонецЕсли
